#Print numbers from 1 to 10 using a for loop.
for i in range(0, 11):
    print(i)

#---------------------------------------------
#Ще можна додати один параметр - крок циклу
print("--------------------------------------")
for i in range(0, 11, 2): #І от цифра 2 вкінці це і буде наш крок. Тобто i буде збільшуватись на 2
    print(i)

#--------------------------------------------- 

print("--------------------------------------")

for i in range(0, 11, 3): #Можна поставити будь-яке число І
    print(i) 