#Print the multiplication table for number n.
n = int(input("Enter number for multiplication table: "))

for i in range (0, 11):
    result = n * i
    print(i,"*",n, "=",result)

#Як це працює і як я до цього дійшла? В нас є і який перечисляє всі цифри від 0 до 10. І в нас є  n - значення яке задає користувач. result
# знаходиться в циклі for і дорівнює n*i, і в нас виводиться всі цифри від одного до 10 помножені на n 

#𓆝 𓆟 𓆞 𓆝 𓆟

















## Мої пасхалки хоч хтось помітить? Якщо так , то хай без пояснень просто скине мені слово "яблуко" в телеграмі